Revit 2026 API

# FamilyNestingBehavior Enumeration

---

This attribute describes the family nesting behavior.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FamilyNestingBehavior
```
```vb
Public Enumeration FamilyNestingBehavior
```
```cpp
public enum class FamilyNestingBehavior
```
```fsharp
type FamilyNestingBehavior
```

| Member name | Value | Description |
| --- | --- | --- |
| Embedded | 0 |  |
| Shared | 1 |  |
| Subelement | 2 |  |

#### Reference

Autodesk.Revit.DB Namespace